In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame()
type(df)

pandas.core.frame.DataFrame

In [5]:
df = pd.read_csv("datasets/PandasExample.csv")
df

           Name  Age  Gender
0        Nithin   24    Male
1         Manoj   30    Male
2  Shivashankar   44    Male
3        Swathi   18  Female
4   Pareekshith   28    Male

In [8]:
df.head(2)

     Name  Age Gender
0  Nithin   24   Male
1   Manoj   30   Male

In [9]:
df.tail(1)

          Name  Age Gender
4  Pareekshith   28   Male

In [13]:
df.iloc[3]

Name      Swathi
Age           18
Gender    Female
Name: 3, dtype: object

In [15]:
df.values

array([['Nithin', 24, 'Male'],
       ['Manoj', 30, 'Male'],
       ['Shivashankar', 44, 'Male'],
       ['Swathi', 18, 'Female'],
       ['Pareekshith', 28, 'Male']], dtype=object)

In [46]:
df = pd.read_csv("datasets/PandasExample.csv", chunksize=2)
df

In [ ]:
df2 = pd.DataFrame()

for chunk in df:
    print(f"Type: {type(chunk)}\nContent:\n{chunk}")
    df2 = pd.concat([df2, chunk])

df2

In [50]:
df2[df2['Age']>=30]

           Name  Age Gender
1         Manoj   30   Male
2  Shivashankar   44   Male